# HasValidRebar Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraintsManager..::..HasValidRebar Method
RebarConstraintsManager Class See Also
---
Checks whether the Manager's Rebar is still valid.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasValidRebar()
```

Visual Basic
---
```text
Public Function HasValidRebar As Boolean
```

Visual C++
---
```text
public:
bool HasValidRebar()
```

# See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace